Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N01.tmx
Source language: en_us
Languages: zh_cn

source: Herman Woulk Is Still Alive
zh_cn: 赫尔曼·沃克还活着

source: I. BRENDA HITS PICK-4 FOR $2,700 AND RESISTS HER FIRST IMPULSE.
zh_cn: I 布伦达彩票中奖得了2700块钱，忍住了第一个冲动

source: Instead of going out for a bottle of Orange Driver to celebrate with, she pays off the MasterCard, which has been maxed like forever.
zh_cn: 她没出门买橘子酒庆祝，而是还清了信用卡，那卡似乎永远处在刷爆中。

source: Then calls Hertz and asks a question.
zh_cn: 然后她给租车公司打电话问了问。

source: Then calls her friend Jasmine, who lives in North Berwick, and tells her about the Pick-4.
zh_cn: 又给住在北贝里克的朋友茉莉打了个电话，把彩票的事告诉她。

source: Jasmine screams and says, "Girl, you're rich!"
zh_cn: 茉莉尖叫着，说，“姑娘，你有钱了！”

source: If only.
zh_cn: 真这样就好了。

source: Brenda explains how she paid off the credit card so she can rent a Chevy Express if she wants to.
zh_cn: 布伦达解释说她还清了信用卡，如果愿意就可以租一辆雪佛兰面包车了。

source: It's a van that seats nine, that's what the Hertz girl told her.
zh_cn: 那是种商务车，可以坐九个人，租车公司的女孩这么告诉她的。

source: "We could get all the kids in there and drive up to Mars Hill.
zh_cn: “咱们可以把孩子全都带着，开上马尔斯山。

source: See your folks and mine.
zh_cn: 去看看你爹妈，还有我的。

source: Show off the grandchildren.
zh_cn: 显摆一下孙子孙女儿。

source: Squeeze 'em for a little more dough.
zh_cn: 再从他们那儿挤点儿钱出来。

source: What do you think?"
zh_cn: 你觉得怎样？”

source: Jasmine is dubious.
zh_cn: 茉莉犹豫不定。

source: The glorified shack her folks call home doesn't have room, and she wouldn't want to stay with them even if it did.
zh_cn: 她父母美其名曰家的那个棚屋没空间，即使有，她也不想和他们呆一起。

source: She hates those two.
zh_cn: 她恨那俩人。

source: With good reason, Brenda knows; her own father broke Jasmine in at fifteen.
zh_cn: 理由很充分，布伦达了解；茉莉十五岁那年被自己的亲身父亲破了身。

source: Her mother knew what was going on and did nothing.
zh_cn: 她母亲知道这事却任其发展。

source: When Jasmine went to her in tears, her ma said, "You got nothing to worry about, he's had his nuts cut."
zh_cn: 茉莉流着泪找她时，她妈说，“没啥担心的，他已经把自己给骟了。”

source: Jas married Mitch Robicheau to get away from them, and now, three men, four kids, and eight years later, she's on her own.
zh_cn: 茉莉为了离开他们嫁给了米奇·罗比奇奥。八年来，三个男人，四个孩子，现在是单身。

source: And on welfare, although she gets sixteen hours a week at the Roll Around, handing out skates and making change for the video arcade, where the machines take only special tokens.
zh_cn: 还有社会救济，但是每星期得在溜冰场工作十六小时，递溜冰鞋，为电子游戏室换投币，那儿的游戏机只用特定的投币。

source: They let her bring her two youngest.
zh_cn: 他们同意她带着最小的那两个。

source: Delight sleeps in the office and Truth, her three-year-old, wanders around in the arcade hitching at his diapers.
zh_cn: 乐乐睡在办公室，真相三岁，包着尿不湿在廊厅里蹒跚转悠。

source: He doesn't get into too much trouble, although last year he got head lice and the two women had to shave all his hair off.
zh_cn: 他不怎么闯祸，不过去年他得了头虱，两个女人只好把他的头发理了个精光。

source: How he howled.
zh_cn: 他那个嚎呀。

source: "There's six hundred left over after I paid off the credit balance," Brenda says.
zh_cn: “还完信用卡剩六百，”布伦达说。

source: "Well, four hundred if you count the rental, only I don't, because I can put that on MasterCard.
zh_cn: “呃，如果要算租车的话剩四百，但我可不那么算，因为这笔钱我可以放信用卡上。

source: We could stay at the Red Roof, watch Home Box.
zh_cn: 咱们可以呆在红屋顶旅馆，看家庭电影频道。

source: It's free.
zh_cn: 免费的。

source: We can get takeout from downstreet and the kids can swim in the pool.
zh_cn: 可以从闹市叫外卖，孩子们可以在泳池里游泳。

source: What do you say?"
zh_cn: 你觉得怎样？”

source: From behind her comes yelling.
zh_cn: 她身后传来了喊叫声。

source: Brenda raises her voice and screams, "Freddy, you stop teasing your sister and give that back!"
zh_cn: 布伦达拔高嗓门尖声说，“弗雷迪，别逗你妹妹了，把那东西还给她！”

source: Then, oh goody, their squabbling wakes up the baby.
zh_cn: 结果，这下可好，他们的口角吵醒了婴儿。

source: Either that or Freedom has messed in her diapers and awakened herself.
zh_cn: 要不就是自由拉脏了尿布把自己弄醒了。

source: Freedom always messes in her diapers.
zh_cn: 自由总是拉在尿布里。

source: To Brenda it seems like Free is making poop her life's work.
zh_cn: 在布伦达看来，自由似乎把拉屎当作了一生的事业。

source: Takes after her father that way.
zh_cn: 这点是随了她爹。

source: "I suppose..."
zh_cn: “我想......

source: Jasmine says, drawing suppose out to four syllables.
zh_cn: ”茉莉说道，把想字拖成了四个音节。

source: Maybe five.
zh_cn: 也许五个。

source: "Come on, girl!
zh_cn: “得了，姑娘！

source: Road trip!
zh_cn: 公路旅行啊！

source: Get with the program!
zh_cn: 快醒醒神！

source: We take the bus down to the Jetport and rent the van.
zh_cn: 咱们乘公共汽车去机场，然后租辆面包车。

source: Three hundred miles, we can be there in four hours.
zh_cn: 三百里地，四个小时就能到。

source: The girl says they can watch DVDs.
zh_cn: 那女孩说他们可以看DVD。

source: The Little Mermaid and all that good stuff."
zh_cn: 有《海的女儿》之类的好片子。”

source: "Maybe I could get some of that government money from my ma before it's all gone," Jasmine says thoughtfully.
zh_cn: “没准儿赶在我妈把那笔政府抚恤金花完之前我还能弄点儿出来，”茉莉若有所思的说。

source: Her brother Tommy died the year before, in Afghanistan.
zh_cn: 她兄弟汤米前年死在了阿富汗。

source: IED.
zh_cn: 简易爆炸装置。

source: Her ma and dad got eighty thousand out of it.
zh_cn: 她爹妈因此得了八万美元。

source: Her ma has promised her some, although not when the old man is in hearing distance of the phone.
zh_cn: 她妈许诺会给她一些，不过这是在离她爹听不见的地方打电话说的。

source: Of course it may be gone already.
zh_cn: 当然，这笔钱也许已经没了。

source: Probably is.
zh_cn: 多半儿是。

source: She knows Mr. Romance bought a Yamaha rice rocket, although what he wants with a thing like that at his age, Jasmine has no idea.
zh_cn: 她知道罗曼史先生买了一辆雅马哈摩托车，他都这把年纪了还要这种东西干什么，茉莉毫无头绪。

source: And she knows things like government money are mostly a mirage.
zh_cn: 而且她知道像政府抚恤金这种东西大都是海市蜃楼。

source: This is something they both know.
zh_cn: 这点他们都知道。

source: Every time you see bright stuff, somebody turns on the rain machine.
zh_cn: 每次你见到点儿艳丽的东西，就有人开动造雨机。

source: The bright stuff is never colorfast.
zh_cn: 艳丽的东西永不会持久如新。

source: "Come on," Brenda says.
zh_cn: “来嘛，”布伦达说。

source: She has fallen in love with the idea of loading up the van with kids and her best (her only) friend from high school, who ended up living just one town over.
zh_cn: 她已经爱上了这个主意：车上满载着孩子和她自高中起最好（唯一）的朋友，茉莉后来住得离她只一城之远。

source: Both of them on their own, seven kids between them, too many lousy men in the rearview, but sometimes they still have a little fun.
zh_cn: 她俩都是单身，共有七个孩子，回顾往昔太多贱男，不过有时她们仍然还有点儿小乐趣。

source: She hears a thunk sound.
zh_cn: 她听见一声巨响。

source: Freddy starts to scream.
zh_cn: 弗雷迪开始尖叫。

source: Glory has whopped him in the eye with an action figure.
zh_cn: 光荣用玩具人抽了他的眼睛。

source: "Glory you stop that or I'll tear you a new one!" Brenda screams.
zh_cn: “光荣你住手，不然我把你的屁股揍烂！”布伦达尖叫着。

source: "He won't give back my Powerpuff!"
zh_cn: “他不把飞天女警还我！”

source: Glory shrieks, and she starts to cry.
zh_cn: 光荣嚎着，开始哭。

source: Now they're all crying- Freddy, Glory, and Freedom- and for a moment grayness creeps over Brenda's vision.
zh_cn: 现在他们全都哭喊着——弗雷迪、光荣，和自由——有那么一刻布伦达的视线渐渐变灰了。

source: She's seen a lot of that grayness lately.
zh_cn: 她最近总是看见那种灰色。

source: Here they are in a three-room third-floor apartment, no guy in the picture (Tim, the latest in her life, took off six months ago), living pretty much on noodles and Pepsi and that cheap ice cream they sell at Walmart, no air-conditioning, no cable TV, she had a job at the Quik-Flash store but the company went busted and now the store's an On the Run and the manager hired some Taco Paco to do her job because Taco Paco can work twelve or fourteen hours a day.
zh_cn: 这是一个三层的三室公寓房，画面内没有男人（蒂姆是她生活中最后一个，六个月前走了），基本靠面条可乐和沃尔玛卖的那种廉价冰激凌过日子，没有空调，没有有线电视，她有过一个照相店的工作，可公司破产了，店面变成了汽车便利店，经理雇了个墨西哥人来干她的工作，因为那人每天可以工作十二或十四个小时。

source: Taco Paco wears a do-rag on his head and a nasty little mustache on his upper lip and he's never been pregnant.
zh_cn: 墨西哥人头上绑着头巾，上唇留着一抹小胡须，而且他从未怀过孕。

source: Taco Paco's job is to get girls pregnant.
zh_cn: 他是让姑娘们怀孕的。

source: They fall for that little mustache and then boom, the line in the little drugstore testing gadget turns blue and here comes another one, just like the other one.
zh_cn: 她们倾倒于那抹小胡须，于是砰的一下，药店里测孕纸上的线条就变成了蓝色，一个孩子出生了，正像前面那个一样。

source: Brenda has personal experience; she tells people she knows who Freddy's father is, but she really doesn't, she had a few drunk nights when they all looked good, and really, come on, how is she supposed to look for a job anyway?
zh_cn: 布伦达有亲身体验。她对人说知道弗雷迪的爹是谁，但她其实并不知道，她有过几个喝醉的晚上，那时他们看上去全都还不错；而且说真的，得了吧，她到底能怎么找工作？

source: She's got these kids.
zh_cn: 有这些孩子呢。

source: What's she supposed to do, leave Freddy to mind Glory and take Freedom to the goddamn job interviews?
zh_cn: 她能怎么做，把弗雷迪留下照看光荣，带着自由去该死的工作面试？

source: Sure, that'll work.
zh_cn: 没错儿，那样也行。

source: And what is there, besides drive-up-window girl at Mickey D's or the Booger King?
zh_cn: 可除了在麦当劳或者汉堡王的行车窗口卖快餐外，又有什么工作呢？

source: Portland has a couple of strip clubs, but wide loads like her don't get that kind of work, and everyone else is broke.
zh_cn: 波特兰有两间脱衣舞俱乐部，可像她这种的胖女人是得不到那种工作的，其他地方都在破产。

source: She reminds herself she hit the lottery.
zh_cn: 她提醒自己彩票中奖了。

source: She reminds herself they could be in a couple of air-conditioned rooms tonight at the Red Roof- three, even!
zh_cn: 她提醒自己今晚她们就能在红屋顶旅馆住进两间有空调的屋子了——甚至三间！

source: Why not?
zh_cn: 干嘛不呢？

source: Things are turning around!
zh_cn: 情况在好转！

source: "Brennie?"
zh_cn: “布伦达？”

source: Her friend sounds more doubtful than ever.
zh_cn: 她的朋友听上去越发疑虑了。

source: "Are you still there?"
zh_cn: “你还在吗？”

source: "Yeah," she says.
zh_cn: “是的，”她说。

source: "Come on, girl, I'm approved.
zh_cn: “快点，姑娘，我的资格通过了。

source: The Hertz chick says the van is red."
zh_cn: 那女的说商务车是红色的。”

source: She lowers her voice and adds: "Your lucky color."
zh_cn: 她压低嗓子补充说：“你的幸运色。”

source: "Did you pay off the credit card online?
zh_cn: “你是在网上付清信用卡的吗？

source: How'd you do that?"
zh_cn: 怎么干的？”

source: Jasmine knows what happened to Brenda's laptop.
zh_cn: 茉莉很知道布伦达的笔记本电脑怎么回事。

source: Freddy and Glory got fighting last month and knocked Brenda's laptop off the bed.
zh_cn: 上个月弗雷迪和光荣打架，把电脑从床上摔了下去。

source: It fell on the floor and broke.
zh_cn: 掉在地上坏了。

source: "I used the one at the library."
zh_cn: “我用了图书馆的。”

source: She says it the way she grew up in Mars Hill saying it: liberry.
zh_cn: 她说这个词还带有在马尔斯山长大的口音：兔书馆。

source: "I had to wait awhile to get on, but it's worth it.
zh_cn: “等了一会儿才用上，不过值得。

source: So what do you say?"
zh_cn: 那么你怎么说？”

source: "Maybe we could get a bottle of Allen's," her friend says.
zh_cn: “也许咱们可以弄上一瓶阿兰，”她这位朋友说。

source: Jasmine loves that Allen's Coffee Brandy, when she can get it.
zh_cn: 茉莉热爱阿兰牌咖啡白兰地，只要她能弄到。

source: In truth, Jasmine loves anything when she can get it.
zh_cn: 实际上，茉莉热爱她能弄到的一切东西。

source: "Apple-solutely," Brenda says.
zh_cn: “那是橘——兑对地，”布伦达说。

source: "And a bottle of Driver for me.
zh_cn: “我要一瓶橘子酒。

source: But I won't drink while I'm behind the wheel, Jas.
zh_cn: 不过我坐在方向盘后面的时候不喝酒，

source: You can, but I'll wait.
zh_cn: 茉儿。你可以喝，我得等等。

source: I have to keep my license.
zh_cn: 我必须保住驾照。

source: It's about all I got left."
zh_cn: 只剩这个了。”

source: "Can you really get any money out of your folks, do you think?"
zh_cn: “你真觉得自己能从父母那儿弄到钱？”

source: Brenda tells herself that once they see the kids- assuming the kids can be bribed (or intimidated) into good behavior- she can.
zh_cn: 布伦达心说只要他们见到孩子——假设这些孩子都能被哄着（或威胁着）表现得乖些——她就能。

source: "But not a word about the lottery," she says.
zh_cn: “只要别提彩票的事，”她说。

source: "No way," Jasmine says.
zh_cn: “不行，”茉莉说。

source: "I was born at night but it wasn't last night."
zh_cn: “我是晚上生的可又不是昨天晚上才生。”

source: They yuk at this one, an oldie but a goodie.
zh_cn: 她们对着这句话咯咯大笑起来，一个老哏，但是个好哏。

source: "So what do you think?"
zh_cn: “那你怎么样？”

source: "I'll have to take Eddie and Rosellen out of school..."
zh_cn: “我得去学校接艾迪和洛斯林......”

source: "BFD," Brenda says.
zh_cn: “多大点儿屁事，”布伦达说。

source: "So what do you think, girl?"
zh_cn: “那你怎么样，姑娘？”

source: After a long pause on the other end, Jasmine says, "Road trip!"
zh_cn: 茉莉在那头沉默了很久后，说，“公路旅行！”

source: "Road trip!" Brenda hollers back.
zh_cn: “公路旅行！”布伦达喊了回去。

source: Then they are chanting it while the three kids bawl in Brenda's Sanford apartment and at least one (maybe two) is bawling in Jasmine's North Berwick apartment.
zh_cn: 她们就那么翻来覆去地说着这件事，其时，有三个孩子在圣福德镇上布伦达的公寓里哭喊着，至少有一个（也许两个）在北贝里克镇茉莉的公寓里哭叫。

source: These are the fat women nobody wants to see when they're on the streets, the ones no guy wants to pick up in the bars unless the hour is late and the mood is drunk and there's nobody better in sight.
zh_cn: 这是两个在街上无人瞩目的胖女人，是那种酒吧里哪个男人都不会挑的女人，除非太晚了，喝醉了，实在见不到有更好的了。

source: What men think when they're drunk- Brenda and Jasmine both know this- is that thunder thighs are better than no thighs at all.
zh_cn: 男人们喝醉时总觉得——布伦达和茉莉对此都很明白——即使肥腿子也聊胜于无。

source: They went to high school together in Mars Hill and now they're downstate and they help each other when they can.
zh_cn: 她们曾一起在马尔斯山上中学，如今都在南部，相互间尽可能地帮助对方。

source: They are the fat women nobody wants to see, they have a litter of children between them, and they are chanting Road trip, road trip like a couple of cheerleading fools.
zh_cn: 她们是没人待见的胖女人，有一大窝孩子，而她们像两个拉拉队的傻妞般念叨着公路旅行、公路旅行。

source: On a September morning, already hot at eight-thirty, this is the way things happen.
zh_cn: 在一个九月的清晨，八点半时已经酷热，事情总是就这样发生了。

source: It's never been any different.
zh_cn: 从无特例。

source: II. SO THESE TWO OLD POETS WHO WERE ONCE LOVERS IN PARIS HAVE A PICNIC NEAR THE BATHROOMS.
zh_cn: II 于是这两位在巴黎曾经是情人的老诗人在洗手间附近野餐。

source: Phil Henreid is seventy-eight now, and Pauline Enslin is seventy-five.
zh_cn: 菲尔·亨瑞德今年七十八岁，宝琳·恩斯林七十五岁。

source: They're both skinny. They both wear spectacles.
zh_cn: 俩人都瘦的皮包骨头，都戴着眼镜。

source: Their hair, white and thin, blows in the breeze.
zh_cn: 他们的头发银白稀疏，在微风中拂动。

source: They've paused at a rest area on I-95 near Fairfield, which is about twenty miles north of Augusta.
zh_cn: 他们停在了95号公路靠近费尔菲尔德的一个服务区，位于奥古斯塔以北大约二十英里处。

source: The rest-area building is barnboard, and the adjacent bathrooms are brick.
zh_cn: 服务区的建筑是板房，相连的洗手间是砖房。

source: They're good-looking bathrooms.
zh_cn: 是些很漂亮的洗手间。

source: Modest bathrooms.
zh_cn: 朴素大方的洗手间。

source: There's no odor.
zh_cn: 没有臭味。

source: Phil, who lives in Maine and knows this rest area well, would never have proposed a picnic here in the summertime.
zh_cn: 菲尔就住在缅因，他太知道这个服务区了，如果是旺季，他绝不会建议在这儿野餐。

source: When the traffic on the interstate swells with out-of-state vacationers, the Turnpike Authority brings in a line of plastic Port-O-Sans, and this pleasant grassy area stinks like hell on New Year's Eve.
zh_cn: 那时，洲际之间的交通塞满了出州度假的人，高速公路收费当局弄了一溜儿塑料的流动厕所，除夕夜里这片怡人的草地臭气熏天。

source: But now the Port-O-Sans are in storage somewhere, and the rest area is nice.
zh_cn: 不过现在流动厕所都在某地的仓库里，休息区很舒适。

source: Pauline puts a checked cloth on the initial-scarred picnic table standing in the shade of an old oak, and anchors it with a wicker picnic basket against a slight warm breeze.
zh_cn: 有张带着姓名缩写字母刻痕的野餐桌立在一颗老橡树的阴影里，宝琳铺上一块格子布，用柳编的餐篮压着抵抗微拂的暖风。

source: From the basket she takes sandwiches, potato salad, melon wedges, and two slices of coconut-custard pie.
zh_cn: 她从篮子里拿出三明治、土豆沙拉、切好的西瓜，和两块蛋奶椰子派。

source: She also has a large glass bottle of red tea. Ice cubes clink cheerfully inside.
zh_cn: 她还有一大瓶红茶，冰块在里面快活地叮当作响。

source: "If we were in Paris, we'd have wine," Phil says.
zh_cn: “如果在巴黎，咱们会有酒，”菲尔说。

source: "In Paris, we never had another sixty miles to drive on the turnpike," she replies.
zh_cn: “在巴黎，我们永远不会还要再开六十英里的高速公路，”她回答道。

source: "That tea is cold and it's fresh.
zh_cn: “茶冰了，很新鲜。

source: You'll have to make do."
zh_cn: 你就这么着吧。”

source: "I wasn't carping," he says, and lays an arthritis-swollen hand over hers (which is also swollen, although marginally less so).
zh_cn: “我不是在挑刺儿，”他说着，把关节浮肿的手盖在她的手（也肿着，只是略好些）上。

source: "This is a feast, my dear."
zh_cn: “我亲爱的，这是顿盛宴。”

source: They smile into each other's used faces.
zh_cn: 微笑融进了彼此沧桑的面孔里。

source: Although Phil has been married three times (and has scattered five children behind him like confetti) and Pauline has been married twice (no children, but lovers of both sexes in the dozens), they still have quite a lot between them.
zh_cn: 菲尔结过三次婚（像婚礼彩屑般在身后撒下了五个孩子），宝琳结过两次婚（没有孩子，但有过几十个异性和同性的情人），尽管如此，他们之间仍然情意绵绵。

source: Much more than a spark.
zh_cn: 远不只是一星半点儿的火花。

source: Phil is both surprised and not surprised.
zh_cn: 菲尔既诧异又不诧异。

source: At his age- late, but not quite yet last call- you take what you can and are happy to get it.
zh_cn: 到了他这个年纪——暮年，但还不算不上是最后一口气——都是取己之所能，得之既安。

source: They are on their way to a poetry festival at the University of Maine's Orono campus, and while the compensation for their joint appearance isn't huge, it's perfectly adequate.
zh_cn: 他们在去缅因大学奥罗诺分校参加一个诗歌节的路上，对于他们联袂出场的报酬，数目并不大但也尽够了。

source: Since he has an expense account, Phil has splurged and rented a Cadillac from Hertz at the Portland Jetport, where he met her plane.
zh_cn: 既然可以报销，菲尔就奢侈了一把，他在波特兰机场的租车公司租了一辆凯迪拉克，在那儿给宝琳接机。

source: Pauline jeered at this, said she always knew he was a plastic hippie, but she does it gently.
zh_cn: 对此宝琳奚落他，说一向都知道他是个伪嬉皮，她说这话的时候很温和。

source: He wasn't a hippie, but he was a genuine whatever-he-was, and she knows it.
zh_cn: 他不是嬉皮，但不管他是什么他都会是纯粹的，她知道这一点。

source: As he knows that her osteoporotic bones have enjoyed the ride.
zh_cn: 就像他知道她这把脆弱疏松的骨头对这次兜风也很享受一样。

source: Now, a picnic.
zh_cn: 现在，一顿野餐。

source: Tonight they'll have a catered meal, but the food will be a lukewarm, sauce-covered mess o' mystery supplied by the cafeteria in one of the college commons.
zh_cn: 今晚他们会有一场宴席，但食物会是大学普通食堂提供的那种温吞吞的抹着酱汁儿的不知什么东西。
